# TASK-2 : Calculate summary statistics
Calculate summary statistics (mean, median,mode, standard deviation) for a dataset

In [108]:
# importing package
import pandas as pd 
import numpy as np

In [109]:
# Loading the data set
df = pd.read_csv(r"C:\Users\t480\Downloads\archive(2)\Titanic-Dataset.csv")

In [110]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [111]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [112]:
# specifaide categorical columns
categorical_columns = df.select_dtypes(include=['object', 'category']).columns.tolist()
# specifaide numerical columns
numerical_columns = df.select_dtypes(include=['int64','float64']).columns.tolist()

In [113]:
print(f"Categorical columns:\n {categorical_columns}")
print(f"Numerical columns:\n {numerical_columns}")

Categorical columns:
 ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']
Numerical columns:
 ['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [114]:
# creating a dataframe of the numerical columns
columns_used =  ['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']
df1 = df.loc[:, columns_used]

In [115]:
df1.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

Let's descover some statistics about the data set

In [116]:
# using mean() methode to calculate the mean for each column
df1_means = df1.mean()
print(f"The mean for each numerical column: {df_means}")

The mean for each numerical column: PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [117]:
# using std() methode to calculate the  standard deviation for each column
df1_std = df1.std()
print(f"The standard deviation for each columns: {df1_std}")

The standard deviation for each columns: PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [118]:
# using median() methode to calculate the  median for each column
df1_median = df1.median()
print(f"The median for each columns: {df1_median}")

The median for each columns: PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [119]:
# using mode() methode to calculate the  mode for each column
df1_mode = df1.mode().iloc[0]
print(f"The mode for each columns: {df1_mode}")

The mode for each columns: PassengerId     1.00
Survived        0.00
Pclass          3.00
Age            24.00
SibSp           0.00
Parch           0.00
Fare            8.05
Name: 0, dtype: float64

In [120]:
# checking the statistical value of columns using describe()
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [121]:
# Now we will use the origine data set to descover more statistic
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [122]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [123]:
df['Survived'].unique() # Here there is two variables that is 0 and 1

array([0, 1], dtype=int64)

In [124]:
df[['Sex', 'Age']].groupby('Sex').mean()

              Age
Sex
female  27.915709
male    30.726645

In [125]:
df[['Survived', 'Age']].groupby('Survived').mean()

                Age
Survived
0         30.626179
1         28.343690

In [126]:
df.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           25.046875
        1           28.847716
male    0           31.618056
        1           27.276022
Name: Age, dtype: float64

THANK YOU!